Краткая сводка по таблицам учебной базы northwnd:
1. Категории – в данной таблице расположены категории товаров по ID, с их описанием и ссылкой на фото.
2. Список контактов – в данной таблице находятся списки контактов по ID, название компании контактного лица, контактное лицо, должность контакта, адрес, город, регион, почтовый индекс, страна, номер телефона, добавочный номер (если есть), номер факса, адрес домашней страницы, путь к фото, фото.
3. Клиент-Клиент Демо – пустая таблица с 2-мя столбцами ID клиента и ID Тип клиента.
4. Клиент Демография – пустая таблица с 2-мя столбцами ID Тип клиента и описание клиента.
5. Клиенты – ID клиента, название компании, контактное лицо, должность, адрес, город, регион (если указан), почтовый индекс, страна, телефон, факс.
6. Сотрудники – ID сотрудника, Фамилия, Имя, должность, титул вежливости (обращение), дата рождения, дата найма, адрес, город, регион (если указан), почтовый индекс, страна, номер телефона, добавочный номер, фото, примечание, отчитывается перед, путь фото.
7. Территории сотрудников – ID сотрудников, ID территории.
8. Детали заказов – ID заказа, ID продукта (товара), цена за штуку (ед.), количество, скидка.
9. Заказы - ID заказа, ID клиента, ID сотрудника, дата заказа, требуемая дата поставки, актуальная дата поставки, доставка через, груз (фрахт), название фирмы куда доставляется, адрес доставки, город доставки, регион доставки (если указан), почтовый индекс получателя, страна получателя.
10. Продукты (товары) - ID продукта (товара), название товара, ID поставщика, ID категории, количество на единицу, цена за штуку (ед.), единиц на складе (в наличии), единиц в заказе, уровень запасов, определяющий необходимость заказа (уровень повторного заказа), снято с производства.
11. Регион – ID региона, Название региона.
12. Грузоотправитель – ID грузоотправитель, название компании, телефон.
13. Поставщики – ID поставщика, Название компании, контактное лицо, должность, адрес, город, регион (если указан), почтовый индекс, страна, телефон, факс (если указан), домашняя страница (если есть).
14. Территории - ID территории, название территории (город), ID региона.