Рефлексия на предыдущее задание:

Сделано правильно, но я немного перестарался и указал больше информации по каждой таблице, чем этого требовалось, но суть верная.

Решение задания 2:

Сотрудники связан с Территории – как многие ко многим, т. к. например 1 сотрудник может быть закреплен
на нескольких территориях или на одной и наоборот на 1 одной территории несколько сотрудников или один.
Связно все это промежуточной таблицей Сотрудники по территориям.
Сотрудники связаны с Заказы – как один ко многим, т. к. бывает, что один заказ у сотрудника и несколько заказов у сотрудника.
Заказы связаны с Товарами – как многие ко многим, через Детали заказа, т. к. у одного заказ может быть 1 товар или много,
и наоборот 1 товар может быть в 1 заказе или в нескольких.
Регион связан с Территориями – как один ко многим, потому что за 1 регионом находятся несколько территорий или одна.
Клиентами связаны с Заказами – один ко многим т. к. у клиента может быть несколько заказов, так и один.
Доставщиками связаны с Заказами – один ко многим т. к. у одного доставщика могут быть много заказов, для разных клиентов, так и один заказ.
Категории товаров связаны с Товары – как один ко многим, у одной категории несколько товаров могут быть.
Поставщик связан с Товары – как один ко одному, т. к. у каждого товара есть только 1 поставщик.
